
<!DOCTYPE html>
<html>
<body>

<form action="1.php" method="post" enctype="multipart/form-data">
	<input type="text" name="field1" id="field1">
	<input type="text" name="field2" id="field2">
    Select image to upload:
    <input type="file" name="fileToUpload" id="fileToUpload">
    <input type="submit" value="Upload Image" name="submit">
</form>

</body>
</html>

<?php

echo 'RES='.(NULL!='string');

//"2beb11cf4116ed68fa97c37a412e41aa"

//var_dump($_REQUEST);
//$s = '[{"files" : [{"file_id" : "5afa61f0-649a-4f3e-b31d-61e365a76497", "file_name" : "ССР в тек ценах Упорово - Сводный сметный расчет1.xls", "file_size" : 37888, "file_signed" : true, "file_uploaded" : "true", "file_path" : "Исходящие заявителя", "signatures" : [{"owner": {"ИНН": "007456030519", "Имя": "Никита Андреевич", "ОГРН": "1167456055238", "Адрес": "УЛ ТЕВОСЯНА, ДОМ 17, КОРП А, ПОМ 9", "Город": "Магнитогорск", "СНИЛС": "14077108946", "Регион": "74 Челябинская область", "Страна": "RU", "Фамилия": "Юрин", "Эл.почта": "office@tlcplus.ru", "Должность": "Генеральный директор", "Организация": "ООО \"ТЕХНОЛОГИИ КОМФОРТНОЙ ЖИЗНИ ПЛЮС\"", "Наименование": "ООО \"ТЕХНОЛОГИИ КОМФОРТНОЙ ЖИЗНИ ПЛЮС\""}, "cert_to": "2019-06-06T00:00:00+05:00", "cert_from": "2018-03-06T00:00:00+05:00", "error_str": null, "check_time": 0.1518, "check_result": true, "sign_date_time": "2018-05-29T16:09:38+05:00"}]}, {"file_id" : "5ff99599-8945-452c-a4f2-dcf4a9c2b444", "file_name" : "ССР в тек ценах Упорово - Сводный сметный расчет1.xls", "file_size" : 37888, "file_signed" : true, "file_uploaded" : "true", "file_path" : "Раздел 6. Проект организации строительства", "signatures" : [{"owner": {"ИНН": "007456030519", "Имя": "Никита Андреевич", "ОГРН": "1167456055238", "Адрес": "УЛ ТЕВОСЯНА, ДОМ 17, КОРП А, ПОМ 9", "Город": "Магнитогорск", "СНИЛС": "14077108946", "Регион": "74 Челябинская область", "Страна": "RU", "Фамилия": "Юрин", "Эл.почта": "office@tlcplus.ru", "Должность": "Генеральный директор", "Организация": "ООО \"ТЕХНОЛОГИИ КОМФОРТНОЙ ЖИЗНИ ПЛЮС\"", "Наименование": "ООО \"ТЕХНОЛОГИИ КОМФОРТНОЙ ЖИЗНИ ПЛЮС\""}, "cert_to": "2019-06-06T00:00:00+05:00", "cert_from": "2018-03-06T00:00:00+05:00", "error_str": null, "check_time": 0.2869, "check_result": true, "sign_date_time": "2018-05-29T16:09:38+05:00"}]}, {"file_id" : "d5097ed6-3e74-48ca-ab87-344ae53c624c", "file_name" : "09-01-01 Утилизация ТБО 40(48).xlsx", "file_size" : 126307, "file_signed" : true, "file_uploaded" : "true", "file_path" : "Раздел 6. Проект организации строительства", "signatures" : [{"owner": {"ИНН": "007206037092", "Имя": "Людмила Павловна", "ОГРН": "1077206003181", "Адрес": "МКР 8, ДОМ 18", "Город": "Тобольск", "СНИЛС": "06339606673", "Регион": "72 Тюменская область", "Страна": "RU", "Фамилия": "Торопова", "Эл.почта": "detskiy_sad_40@mail.ru", "Должность": "Директор", "Организация": "МАДОУ \"ДЕТСКИЙ САД \\U2116 40 - ЦРР\" Г. ТОБОЛЬСКА", "Наименование": "МАДОУ \"ДЕТСКИЙ САД \\U2116 40 - ЦРР\" Г. ТОБОЛЬСКА"}, "cert_to": "2019-04-06T00:00:00+05:00", "cert_from": "2018-04-06T00:00:00+05:00", "error_str": null, "check_time": 0.4128, "check_result": true, "sign_date_time": "2018-06-19T10:22:23+05:00"}]}, {"file_id" : "c5feecbd-4126-40a2-96a1-a7486c37bf00", "file_name" : "СМ.ПЗ 40(48).doc", "file_size" : 54784, "file_signed" : true, "file_uploaded" : "true", "file_path" : "Раздел 6. Проект организации строительства", "signatures" : [{"owner": {"ИНН": "007206037092", "Имя": "Людмила Павловна", "ОГРН": "1077206003181", "Адрес": "МКР 8, ДОМ 18", "Город": "Тобольск", "СНИЛС": "06339606673", "Регион": "72 Тюменская область", "Страна": "RU", "Фамилия": "Торопова", "Эл.почта": "detskiy_sad_40@mail.ru", "Должность": "Директор", "Организация": "МАДОУ \"ДЕТСКИЙ САД \\U2116 40 - ЦРР\" Г. ТОБОЛЬСКА", "Наименование": "МАДОУ \"ДЕТСКИЙ САД \\U2116 40 - ЦРР\" Г. ТОБОЛЬСКА"}, "cert_to": "2019-04-06T00:00:00+05:00", "cert_from": "2018-04-06T00:00:00+05:00", "error_str": null, "check_time": 0.2856, "check_result": true, "sign_date_time": "2018-06-19T10:22:42+05:00"}]}]}]';
$s = '[{"a":"1","b":"2"}]';
$file_ar = json_decode($s);
var_dump($file_ar);
?>
